import Link from "next/link";

export default function Policy() {
  return (
    <main className="main policy">
      <div className="wrapper inline-wide">
        <h1 className="data-main-headline"> Політика конфіденційності </h1>
        <p className="data-description">
          На цій веб-сторінці розміщена політика конфіденційності нашого
          веб-сайту
          <Link className="data-link" href="/">
            www.eurobud.tech
          </Link>
          .
        </p>
        <h1 className="data-headline"> Вступ </h1>
        <p className="data-content">
          Конфіденційність користувачів нашого веб-сайту має велике значення для
          нас, і ми докладаємо всіх зусиль для забезпечення її захисту. Дані
          правила пояснюють, як ми використовуємо вашу персональну інформацію.
          Використовуючи наш веб-сайт та/або надаючи нам свою особисту
          інформацію, ви автоматично погоджуєтесь з умовами цієї політики
          конфіденційності.
        </p>
        <h1 className="data-headline"> Збір персональних даних </h1>
        <p className="data-content">
          Збору, зберіганню та використанню підлягають наступні типи
          персональних даних:
        </p>
        <ul className="data-items-list">
          <li className="data-item">
            Інформація про ваш комп’ютер, включаючи вашу IP-адресу, географічне
            розташування, тип і версію браузера та операційну систему;
          </li>
          <li className="data-item">
            Інформація про ваші відвідування та використання цього веб-сайту,
            включаючи реферальні джерела, протяжність візитів, переглянуті
            сторінки та шляхи навігації по сайту;
          </li>
          <li className="data-item">
            Інформація про адресу вашої електронної пошти, яку ви використали
            для подання заявки на нашому веб-сайті;
          </li>
          <li className="data-item">
            Інформація, яку ви ввели під час створення профілю на нашому
            веб-сайті – наприклад, ваше ім’я, зображення у вашому профілі,
            стать, дата народження, сімейний статус, хобі та інтереси, освіта та
            місце роботи;
          </li>
          <li className="data-item">
            Інформація, така, як ваше ім’я та адреса електронної пошти, які ви
            вказали під час оформлення підписок на наші поштові повідомлення
            та/або розсилки;
          </li>
          <li className="data-item">
            Інформація, яку ви ввели під час використання сервісів нашого
            веб-сайту;
          </li>
          <li className="data-item">
            Інформація, яка генерується при використанні нашого веб-сайту,
            включаючи інформацію про час, частоту та умови його використання;
          </li>
          <li className="data-item">
            Інформація стосовно будь-яких ваших покупок, використаних сервісів
            або транзакцій, які ви провели через наш веб-сайт, включаючи ваше
            ім’я, адресу, номер телефону, адресу електронної поштової скриньки
            та інформацію про кредитну карту;
          </li>
          <li className="data-item">
            Інформація, яку ви розмістили на нашому веб-сайті з метою публікації
            її в Інтернеті, включаючи ваше ім’я користувача, зображення профілю
            та зміст вашої публікації;
          </li>
          <li className="data-item">
            Інформація, що міститься в будь-яких повідомленнях, які ви надсилали
            нам електронною поштою або через наш веб-сайт, включаючи зміст
            повідомлення та мета дані;
          </li>
          <li className="data-item">
            Будь-яка інша персональна інформація, яку ви надіслали нам.
          </li>
        </ul>
        <p className="data-content">
          Перед тим, як розкрити для нас персональну інформацію третьої особи,
          ви маєте отримати згоду цієї особи як на розкриття, так і на обробку
          цієї інформації у відповідності до даних правил.
        </p>
        <h1 className="data-headline">
          Використання вашої персональної інформації
        </h1>
        <p className="data-content">
          Персональна інформація, яку ви передані нам через наш веб-сайт, буде
          використовуватися задля цілей, зазначених в цих правилах або на
          відповідних сторінках веб-сайту. Ми можемо використовувати вашу
          персональну інформацію в наступних цілях:
        </p>
        <ul className="data-items-list">
          <li className="data-item">
            Адміністрування нашого веб-сайту та бізнесу;
          </li>
          <li className="data-item">
            Персоналізація нашого веб-сайту для вас;
          </li>
          <li className="data-item">
            Надання вам можливості користуватися сервісами, доступними на нашому
            веб-сайті;
          </li>
          <li className="data-item">
            Надсилання вам товарів, придбаних через наш-веб-сайт;
          </li>
          <li className="data-item">
            Надання вам послуг, придбаних через наш веб-сайт;
          </li>
          <li className="data-item">
            Надсилання вам повідомлень, рахунків та нагадувань про сплату, та
            отримання платежів від вас;
          </li>
          <li className="data-item">
            Надсилання вам немаркетингових комерційних повідомлень;
          </li>
          <li className="data-item">
            Надсилання вам електронною поштою повідомлень, які ви спеціально
            запросили;
          </li>
          <li className="data-item">
            Надсилання вам електронної розсилки, якщо ви її замовили (ви в
            будь-який момент можете повідомити нас, що більше не бажаєте
            отримувати електронні розсилки від нас);
          </li>
          <li className="data-item">
            Надсилання вам маркетингових повідомлень стосовно нашої ділової
            активності або ділової активності старанно відібраних сторонніх
            компаній, яка, на нашу думку, може вас зацікавити, шляхом публікацій
            або, якщо ви конкретно надали на це згоду – шляхом надсилання
            електронної пошти або за рахунок використання подібних технологій
            (ви в будь-який момент можете повідомити нас, що більше не бажаєте
            отримувати маркетингові повідомлення);
          </li>
          <li className="data-item">
            Надання стороннім компаніям статистичної інформації про наших
            користувачів (проте, ці сторонні компанії не матимуть змоги
            ідентифікувати жодного окремого користувача з цих даних);
          </li>
          <li className="data-item">
            Обробка запитів та скарг, зроблених вами або на вас, і які
            стосуються нашого веб-сайту;
          </li>
          <li className="data-item">
            З метою забезпечення безпеки нашого веб-сайту та попередження
            шахрайства;
          </li>
          <li className="data-item">
            З метою перевірки відповідності умовам та правилам, які
            регламентують використання нашого веб-сайту (включаючи моніторинг
            приватних повідомлень, надісланих через сервіс приватних повідомлень
            нашого веб-сайту);
          </li>
          <li className="data-item">Та в інших цілях.</li>
        </ul>
        <p className="data-content">
          Якщо ви надали персональну інформацію для публікації на нашому
          веб-сайті, ми опублікуємо її. В іншому випадку, ми використовуватимемо
          цю інформацію у відповідності до ліцензії, яку ви нам надали.
        </p>
        <p className="data-content">
          Ваші налаштування конфіденційності можуть використовуватись для
          обмеження публікації ваших персональних даних на нашому веб-сайті, і
          можуть регулюватися за допомогою засобів управління конфіденційністю
          на веб-сайті.
        </p>
        <p className="data-content">
          Без вашої чітко вираженої згоди ми не будемо передавати вашу
          персональну інформацію жодній сторонній компанії для прямого
          маркетингового використання цією, або будь-якою іншою сторонньою
          компанією.
        </p>
        <h1 className="data-headline"> Розкриття персональної інформації </h1>
        <p className="data-content">
          Ми лишаємо за собою право розкрити вашу персональну інформацію для
          будь-якого з наших працівників, керівників, страхувальників,
          професійних радників, агентів, постачальників або субпідрядників, в
          об’ємі та цілях, визначених в цих правилах.
        </p>
        <p className="data-content">
          Ми лишаємо за собою право розкрити вашу персональну інформацію для
          будь-якого члена нашої групи компаній (сюди входять наші дочірні
          компанії, наша кінцева холдингова компанія та всі її дочірні компанії)
          в об’ємі та цілях, визначених в цих правилах.
        </p>
        <p className="data-content">
          Ми лишаємо за собою право розкрити вашу персональну інформацію:
        </p>
        <ul className="data-items-list">
          <li className="data-item">
            В тих випадках, в яких цього від нас вимагає закон;
          </li>
          <li className="data-item">
            У зв’язку з будь-яким поточними або майбутніми судовими процесами;
          </li>
          <li className="data-item">
            З метою встановлення, реалізації або захисту наших законних прав
            (включаючи надання інформації іншим сторонам задля запобігання
            шахрайству або зниження кредитних ризиків);
          </li>
          <li className="data-item">
            Покупцеві (або потенційному покупцеві) будь-якого бізнесу або
            активів, які ми продаємо (або збираємося продати);
          </li>
          <li className="data-item">
            Та будь-якій особі, яка, як ми обґрунтовано вважаємо, може подати
            запит до суду або іншого уповноваженого органу про розкриття цих
            персональних даних і, на нашу обґрунтовану думку, цей суд або
            уповноважений орган видасть розпорядження на розкриття цих
            персональних даних.
          </li>
        </ul>
        <p className="data-content">
          Ми не будемо розкривати вашу персональну інформацію третім особам, за
          виключенням випадків, зазначених в цих правилах.
        </p>
        <h1 className="data-headline">
          Міжнародні передачі персональної інформації
        </h1>
        <p className="data-content">
          Інформація, яку ми збираємо, може зберігатися, оброблятися та
          передаватися між будь-якими країнами, в яких ми здійснюємо свою
          діяльність, з метою надання нам можливості використовувати цю
          інформацію у відповідності з цими правилами.
        </p>
        <p className="data-content">
          Інформація, яку ми збираємо, може бути передана в наступні країни, де
          немає законів із захисту даних, аналогічних тим, що діють на території
          Європейської Економічної Зони: США, Японія, Китай та Індія.
        </p>
        <p className="data-content">
          Персональна інформація, які ви публікуєте на нашому веб-сайті, через
          Інтернет, може бути доступна в усьому світі. Ми не можемо перешкодити
          її використанню, або неправомірному використанню в злочинних цілях,
          сторонніми особами.
        </p>
        <p className="data-content">
          Погоджуючись з цими правилами, ви надаєте згоду на передачу вашої
          персональної інформації, зазначеної в розділі Міжнародні передачі
          персональної інформації.
        </p>
        <h1 className="data-headline"> Збереження персональної інформації </h1>
        <p className="data-content">
          Розділ Збереження персональної інформації встановлює правила та
          процедури компанії щодо збереження персональної інформації. Дані
          правила та процедури призначені для забезпечення виконання нами наших
          юридичних зобов’язань щодо збереження та видалення персональної
          інформації.
        </p>
        <p className="data-content">
          Персональна інформація, яку ми обробляємо з певною метою або в певних
          цілях не повинна зберігатися довше, ніж потрібно для досягнення цієї
          мети або цих цілей.
        </p>
        <p className="data-content">
          Без обмежень положень, зазначених в пункті Збереження персональної
          інформації , ми зазвичай видаляємо персональну інформацію, що підпадає
          у визначені нижче категорії, в дні та час, що визначені нижче:
          персональна інформація буде видалена 01.11.2029 р./13.00.
        </p>
        <p className="data-content">
          Незважаючи на інші положення Розділу Збереження персональної
          інформації, ми будемо зберігати документи (включаючи електронні
          документи), які містять персональну інформацію:
        </p>
        <ul className="data-items-list">
          <li className="data-item">
            В тих випадках, в яких цього від нас вимагає закон;
          </li>
          <li className="data-item">
            Якщо ми вважатимемо, що ці документи можуть мати відношення до
            будь-якого поточного або майбутнього судового розгляду;
          </li>
          <li className="data-item">
            Та з метою встановлення, реалізації або захисту наших законних прав
            (включаючи надання інформації іншим сторонам задля запобігання
            шахрайству або зниження кредитних ризиків).
          </li>
        </ul>
        <h3 className="data-headline">Захист вашої персональної інформації</h3>
        <p className="data-content">
          Ми будемо вживати достатні технічні та організаційні заходи для
          попередження втрати, протиправного використання чи підробки вашої
          персональної інформації.
        </p>
        <p className="data-content">
          Всю надану вами персональну інформацію ми будемо зберігати на наших
          захищених серверах та/або на інших захищених платфорах.
        </p>
        <p className="data-content">
          Всі електронні фінансові транзакції, здійснені за допомогою нашого
          веб-сайту, будуть захищені технологією шифрування даних.
        </p>
        <p className="data-content">
          Ви підтверджуєте своє ознайомлення з тим фактом, що передача
          інформації через Інтернет по суті є незахищеною, і ми не можемо
          гарантувати захист даних, надісланих через всесвітню мережу.
        </p>
        <p className="data-content">
          Ви несете повну відповідальність за збереження свого пароля для
          доступу на наш веб-сайт в таємниці. Ми ніколи не будемо запитувати ваш
          пароль (за виключенням випадків, коли ви намагаєтесь увійти до свого
          облікового запису на нашому веб-сайті).
        </p>
        <h3 className="data-headline"> Зміни та поправки </h3>
        <p className="data-content">
          Ми лишаємо за собою право в будь-який час вносити зміни та поправки в
          ці правила, та публікувати їх нову редакцію на нашому веб-сайті. Ви
          повинні періодично перевіряти цю веб-сторінку, щоб пересвідчитись, що
          розумієте зміст змін, внесених до цих правил. Такі зміни негайно
          набирають чинності після їх оприлюднення на нашому веб-сайті. Ми також
          можемо проінформувати вас про внесення змін до цих правил шляхом
          надсилання електронної пошти або через систему передачі приватних
          повідомлень нашого веб-сайту.
        </p>
        <h3 className="data-headline"> Ваші права </h3>
        <p className="data-content">
          Ви можете надати нам вказівку надавати вам будь-яку персональну
          інформацію про вас, яку ми маємо, якщо це не суперечить чинному
          законодавству та нормативним актам. Надіславши електроний лист з
          проханням на адресу
          <Link className="data-link" href="mailto:office.dobrodiy@gmail.com">
            office.dobrodiy@gmail.com
          </Link>
          .
        </p>
        <p className="data-content">
          Ви маєте право надати нам вказівку не обробляти вашу персональну
          інформацію в маркетингових цілях.
        </p>
        <p className="data-content">
          На практиці, ви, зазвичай, або завчасно погоджуєтесь з тим, щоб ми
          використовували вашу персональну інформацію в маркетингових цілях, або
          ми надамо вам можливість відмовитися від використання вашої інформації
          в маркетингових цілях.
        </p>
        <h3 className="data-headline"> Сторонні веб-сайти </h3>
        <p className="data-content">
          Наш веб-сайт може містити посилання на інші веб-сайти, які не належать
          або не контролюються нами. Ми не несемо відповідальності за збір,
          використання та розкриття інформації на таких веб-сайтах. Ми не маємо
          інструментів керування, та не несемо відповідальності за політику
          конфіденційності й практики сторонніх осіб та компаній в цій галузі.
          Ми рекомендуємо ознайомитись з політикою конфіденційності кожного
          іншого веб-сайту, який ви відвідуєте.
        </p>
        <h3 className="data-headline"> Оновлення інформації </h3>
        <p className="data-content">
          Будь-ласка, своєчасно повідомляйте нас, якщо ваша персональна
          інформація, яка знаходиться у нас, потребує оновлення чи виправлень.
        </p>
        <h3 className="data-headline"> Файли-Cookies </h3>
        <p className="data-content">
          Наш веб-сайт може використовувати файли-cookies. Cookie — це файл, що
          містить ідентифікатор (стрічку, яка складається з літер та цифр), і
          який надсилається веб-сервером до веб-браузеру, та зберігається
          браузером. В подальшому, ідентифікатор надсилається назад на сервер
          кожного разу, коли браузер запитує веб-сторінку з серверу.
          Файли-cookies можуть бути або «постійними» або «сеансові»: постійні
          будуть зберігатися браузером та будуть придатними до завершення
          терміну дії, якщо тільки не будуть видалені користувачем завчасно;
          «сеансові» навпаки – будуть видалятися після завершення сеансу роботи
          з веб-сайтом або після закриття браузеру. Файли-cookies зазвичай не
          містять жодної інформації, яка ідентифікує особу користувача. Проте,
          ваша персональна інформація, яку ми маємо, може бути пов’язана з
          інформацією, що зберігається та отримана від файлів-cookies. Наш
          веб-сайт може використовувати як постійні, так і сеансові
          файли-cookies.
        </p>
        <p className="data-content">
          Більшість браузерів надають вам можливість відмовитися від
          використання файлів-cookies, наприклад:
        </p>
        <ul className="data-items-list">
          <li className="data-item">
            В Internet Explorer (версія 10) ви можете заблокувати використовуючи
            налаштування керування файлами-cookie, доступними в меню
            «Інструменти» – «Опції Інтернету» – «Конфіденційність» – «Розширені»
            ( “Tools,” “Internet Options,” “Privacy,” “Advanced”);
          </li>
          <li className="data-item">
            В Firefox (версія 24) ви можете заблокувати всі файли-cookie,
            натиснувши «Інструменти» – «Опції» – «Конфіденційність»: у
            випадаючому меню оберіть пункт «Використовувати користувацькі
            налаштування журналу» та зніміть виділення з пункту «Прийняти
            файли-cookie від сайтів»;
          </li>
          <li className="data-item">
            В Chrome (версія 29) ви можете заблокувати всі файли-cookie
            увійшовши до меню «Налаштування та управління», та обравши
            «Налаштування» – «Відобразити розширені налаштування» та
            «Налаштування контенту», а потім обравши «Заборонити сайтам
            надсилати будь-які дані» під заголовком «Cookies».
          </li>
        </ul>
        <p className="data-content">
          Блокування всіх файлів-cookiе матиме негативні наслідки на зручність
          користування багатьма веб-сайтами. Якщо ви заблокуєте файли-cookie, ви
          не зможете користуватися багатьма функціями нашого веб-сайту.
        </p>
        <p className="data-content">
          Ви можете видалити файли-cookie, які вже зберігаються на вашому
          комп’ютері, наприклад:
        </p>
        <ul className="data-items-list">
          <li className="data-item">
            В Internet Explorer (версія 10), ви маєте видаляти файли-cookie
            вручну (інструкцію, як це зробити, можна знайти за адресою
            http://support.microsoft.com/kb/278835 );
          </li>
          <li className="data-item">
            В Chrome (версія 29) ви можете видалити всі файли-cookie увійшовши
            до меню «Налаштування та управління», та обравши «Налаштування» –
            «Відобразити розширені налаштування» та «Очистити дані перегляду», а
            перед тим оберіть пункт «Видалити файли-cookie та інші дані й
            плагіни сайтів».
          </li>
        </ul>
        <p className="data-content">
          Видалення файлів-cookiе матиме негативні наслідки на зручність
          користування багатьма веб-сайтами.
        </p>
      </div>
    </main>
  );
}
