export default function Terms() {
  return (
    <main className="main flex terms">
      <div className="wrapper inline-wide">
        <h1 className="data-main-headline">Умови Використання</h1>
        <p className="data-description">
          На цій сторінці викладено умови, які регулюють використання
          матеріалів, що публікуються на нашому веб-сайті
          <a className="data-link" href="/">
            www.eurobud.tech
          </a>{" "}
          (далі – «Сайт», «Веб-Сайт», «Ми», «Компанія»).
        </p>
        <h1 className="data-headline"> 1. Загальні умови </h1>
        <p className="data-content">
          1.1. Якщо ви вирішили користуватися Сайтом і додатками Сайту, включно
          з RSS, API, програмним забезпеченням та іншими файлами, ви надаєте
          згоду на дотримання всіх умов, викладених у цих Правилах користування
          сайтом (далі – Правила), у тому числі, шляхом реєстрації на Сайті
          вашого облікового запису (аккаунту). Ці Правила є юридично
          обов’язковою угодою між користувачем і Компанією, предметом якої є
          надання користувачеві послуг із використання Сайту та його сервісів.
        </p>
        <p className="data-content">
          1.2. Ми можемо в будь-який час змінювати умови, викладені в цих
          Правилах, і такі зміни набирають чинності негайно після їх
          оприлюднення на Сайті.
        </p>
        <p className="data-content">
          1.3. Ви зобов’язані ознайомлюватися з цими Правилами перед кожним
          користуванням Сайтом. Якщо ви продовжуєте користуватися Сайтом після
          оприлюднення змінених Правил, це означає вашу згоду на дотримання
          Правил із усіма їхніми змінами.
        </p>
        <p className="data-content">
          1.4. Якщо будь-які умови цих Правил або зміни до них неприйнятні для
          вас, ви можете не розпочинати користування Сайтом або припинити дію
          вашого облікового запису в порядку, визначеному розділом 7 Умов
          Використання.
        </p>
        <h1 className="data-headline"> 2. Контент Сайту </h1>
        <h2 className="data-content">
          {" "}
          2.1. Матеріали, опубліковані на Сайті, призначені для вашого
          особистого некомерційного використання. Усі матеріали, опубліковані на
          Сайті, включно з, але не обмежуючись: новини, фотографії, зображення,
          ілюстрації, аудіо та відеокліпи (далі – «матеріали» або «контент»)
          захищені авторським правом і знаходяться у володінні або під контролем
          Компанії або сторони, яка є постачальником контенту. Ви повинні
          дотримуватися всіх додаткових повідомлень про авторські права,
          інформації або обмежень, що містяться на будь-якій сторінці.
        </h2>
        <p className="data-content">
          2.2. Зміст Сайту захищений авторським правом відповідно до
          законодавства України та міжнародного авторського права. Ви не маєте
          права змінювати, публікувати, передавати, брати участь у передачі або
          продажу, відтворювати (за винятком випадків, передбачених в пункті 2.4
          цих Правил), створювати нові твори, поширювати, виконувати, або
          яким-небудь чином використовувати зміст Сайту (включно з програмним
          забезпеченням) в цілому або частково.
        </p>
        <p className="data-content">
          2.3. Комерційні (фірмові) найменування, торговельні марки тощо
          Компаній або третіх осіб захищені правами інтелектуальної власності.
          Ніщо, зазначене в цих Правилах, не може тлумачитися як надання
          опосередковано, за замовчуванням або іншим шляхом будь-якої ліцензії
          або права на використання торговельної марки, патенту, прав на дизайн
          або авторських прав Компанії або третіх осіб.
        </p>
        <p className="data-content">
          2.4. Ви можете завантажити або скопіювати вміст Сайту, інші компоненти
          та елементи, що відображаються на Сайті, тільки для особистого
          використання, за умови дотримання всіх авторських прав та інших
          повідомлень, що містяться в ньому. Копіювання чи зберігання будь-якого
          контенту для потреб, відмінних від особистого використання, суворо
          забороняється без попередньої письмової згоди Компанії.
        </p>
        <p className="data-content">
          2.5. Інтернет-порталам, мобільним додаткам дозволяється безкоштовно
          використовувати інформацію, розміщену на Сайті, за умови відкритого
          гіперпосилання та згадки першоджерела та в обсязі, що не перевищує
          півтори тисячі знаків оригінального тексту. Використання більшого
          обсягу тексту можливе лише за умови отримання письмового дозволу
          Компанії.
        </p>
        <p className="data-content">
          Під використанням інформації мається на увазі будь-яке відтворення,
          републікація, поширення, переробка, переклад, включення його частин до
          інших творів та інші способи, передбачені Законом України «Про
          авторське право і суміжні права».
        </p>
        <p className="data-content">
          Компанія надає письмовий дозвіл на використання своїх матеріалів
          третім особам на свій розсуд на підставі звернення, надісланого в
          електронній формі на{" "}
          <a className="data-link" href="mailto:office.dobrodiy@gmail.com">
            office.dobrodiy@gmail.com
          </a>
          із обов’язковим зазначенням зворотної поштової адреси. Компанія
          залишає за собою право в процесі розгляду звернення вимагати від
          третіх осіб будь-яку додаткову інформацію, необхідну для ухвалення
          рішення щодо видачі письмового дозволу. Використання матеріалів
          Компанії можливе тільки після отримання третьою особою відповідного
          письмового дозволу.
        </p>
        <h1 className="data-headline"> 3. Заяви та гарантії </h1>
        <p className="data-content">
          3.1. Ви запевнюєте, гарантуєте та обіцяєте (а), що дані будь-якого
          роду, представлені через Ваш аккаунт (І) не будуть порушувати права
          третіх осіб, включаючи авторське право, товарні знаки, недоторканність
          приватного життя або інших особистих або майнових прав, або (II)
          містити незаконний матеріал, а також (б), Ви щонайменше досягнули
          вісімнадцяти років.
        </p>
        <p className="data-content">
          3.2. Цим гарантуєте, що Ви відшкодуєте збитки, захистите та огородите
          Компанію та всіх посадових осіб, директорів, власників, агентів,
          постачальників інформації, афілійованих осіб, ліцензіарів і
          ліцензіатів від будь-якої відповідальності і витрат, включаючи судові
          витрати, що були понесені у зв'язку з будь-яким позовом, що
          спричинений порушенням цих Правил, гарантій і угод Вами або будь-яким
          користувачем Вашого аккаунту. Ви повинні розумно співпрацювати на
          захист будь-якого такого позову. Компанія залишає за собою право за
          свій рахунок прийняти на себе винятковий захист і контроль будь-якого
          питання, які вимагають компенсації від Вас.
        </p>
        <p className="data-content">
          3.3. Компанія не гарантує і не підтверджує точності або надійності
          будь-яких порад, думок, заяв чи іншої завантаженої або розповсюдження
          інформації через аккаунти будь-яких користувачів, постачальників
          інформації або будь-яких інших фізичних чи юридичних осіб. Ви визнаєте
          та усвідомлюєте, що покладання на такі думки, поради, заяви,
          меморандуми або іншу інформацію здійснюється Вами на власний страх і
          ризик. Матеріали Сайту поширюються «як є», без будь-яких гарантій,
          включаючи гарантії на право власності або придатності для конкретних
          цілей. Цим Ви визнаєте, що користуєтеся Сайтом на свій страх і ризик.
        </p>
        <h1 className="data-headline"> 4. Реєстрація та безпека </h1>
        <p className="data-content">
          4.1. Як частина процесу реєстрації або створення облікового запису, Ви
          будете створювати облікові дані для входу, вибравши пароль та надання
          адреси електронної пошти. Ви також повинні надати Нам певні відомості
          про себе, які повинні бути точними і оновленими.
        </p>
        <p className="data-content">
          4.2. Кожна реєстрація дійсна для одного користувача. Ви не можете
          поділитися своїми обліковими даними реєстрації для входу, щоб ніхто
          інший не мав доступу до Вашого аккаунту. Ми можемо скасувати або
          призупинити Ваш доступ до Сайту, якщо Ви поділитеся своїми обліковими
          даними для входу. Ви несете відповідальність за збереження
          конфіденційності пароля, який Ви не повинні відкривати будь-якому
          представнику або агенту Компанії. Ви не можете (а) вибрати або
          використовувати облікові дані іншої людини з тією метою, щоб видати
          себе за цю людину, (б) використовувати дані облікового запису без
          права дозволу власника, або (в) використовувати облікові дані, на свій
          розсуд, якщо вони є чи вважаються образливими. Недотримання
          вищезазначених положень вважається порушенням Правил, які можуть
          призвести до негайного припинення існування Вашого аккаунту.
        </p>
        <p className="data-content">
          4.3. Ми вітаємо участь людей будь-якого віку на Сайті, однак з метою
          захисту дітей – особи до досягнення повноліття не можуть здійснювати
          реєстрацію на Сайті.
        </p>
        <p className="data-content">
          4.4. Ви зобов’язані повідомити на про будь-які відомі або
          передбачувані випадки несанкціонованого використання Вашого аккаунту,
          або про будь-яке відоме або передбачуване порушення безпеки, у тому
          числі втрату, крадіжку або несанкціоноване розкриття Вашого пароля.
        </p>
        <p className="data-content">
          4.5. Ви несете відповідальність за будь-яке використання чи діяльність
          на Вашому обліковому запису на Сайті, в тому числі за використання
          аккаунту третіми особами з Вашого дозволу. Будь-яка шахрайська,
          образлива або інша протизаконна діяльність може бути підставою для
          припинення дій Вашого облікового запису, на власний розсуд, і Ми
          можемо направити відомості до відповідних правоохоронних органів.
        </p>
        <h1 className="data-headline">
          {" "}
          5. Зв'язок між Сайтом і користувачами{" "}
        </h1>
        <p className="data-content">
          5.1. Якщо Ви заповнюєте реєстраційну форму з метою отримання певної
          інформації, Ми, як власники і правонаступники, з дозволу певних
          сторонніх постачальників, надаємо Вам інформацію про матеріали,
          опубліковані на Сайті.
        </p>
        <p className="data-content">
          5.2. Ви надаєте, а Компанія залишає за собою право відправляти на Вашу
          електронну пошту інформацію про зміни або доповнення товарів і послуг
          на Сайті.
        </p>
        <p className="data-content">
          5.3. Компанія залишає за собою право розкривати інформацію про
          використання та демографію за умови, що це не буде розкривати Вашу
          особистість. Рекламодавці на сайті можуть збирати і поширювати
          особисту інформацію про Вас, тільки якщо Ви підтверджуєте свою згоду
          відповідно до Політики конфіденційності та захисту персональних даних
          Компанії.
        </p>
        <p className="data-content">
          5.4. Компанія може зв'язатися з Вами по електронній пошті про Вашу
          участь в опитуванні користувачів, ставлячи питання з метою покращення
          поточних або перспективних матеріалів. Ця інформація буде використана
          для покращення роботи Сайту і для кращого розуміння наших
          користувачів. Будь-яка інформація, яку ми отримуємо в таких
          опитуваннях, не буде передана третім особам, за винятком узагальнених
          знеособлених даних.
        </p>
        <h1 className="data-headline"> 6. Припинення доступу до Сайту </h1>
        <p className="data-content">
          6.1. Ви можете припинити дію аккаунту в будь-який момент, звернувшись
          на{" "}
          <a className="data-link" href="mailto:office.dobrodiy@gmail.com">
            office.dobrodiy@gmail.com
          </a>{" "}
          Ви отримаєте автоматичне підтвердження по електронній пошті, що заяву
          на видалення аккаунту прийнято, і Ваш доступ буде припинений протягом
          24 годин.
        </p>
        <p className="data-content">
          6.2. Компанія може на свій власний розсуд видалити або призупинити
          доступ до всього Сайту або його частини з будь-якої причини,
          включаючи, порушення або невиконання цих Правил.
        </p>
        <h1 className="data-headline"> 7. Різне </h1>
        <p className="data-content">
          7.1. Ці Правила застосовуються відповідно до законодавства України.
          Будь-які спори щодо реалізації цих Правил вирішуватимуться відповідним
          судом, у порядку, визначеному чинними законодавством України.
        </p>
        <p className="data-content">
          7.2. Незважаючи на будь-які положення з вищевикладеного, нічого в цих
          Правилах не може використовуватися для тлумачення положень, зазначених
          в Політиці конфіденційності.
        </p>
        <p className="data-content">
          7.3. Листування слід здійснювати на{" "}
          <a className="data-link" href="mailto:office.dobrodiy@gmail.com">
            office.dobrodiy@gmail.com
          </a>
          .
        </p>
        <p className="data-content">
          7.4. Ви погоджуєтесь негайно повідомляти про будь-які порушення
          авторських прав щодо матеріалів Сайту. Про виникнення претензій з
          вашого боку щодо порушення авторських прав стосовно матеріалів, які
          містяться на Сайті, повідомляйте на{" "}
          <a className="data-link" href="mailto:office.dobrodiy@gmail.com">
            office.dobrodiy@gmail.com
          </a>
          .
        </p>
        <p className="data-content">
          7.5. Матеріали можуть містити посилання, пов’язані з іншими World
          inline-wide Web Інтернет-сайтами, ресурсами та рекламодавцями.
          Оскільки Ми не несемо відповідальності за доступність цих зовнішніх
          ресурсів або їхній зміст, ви повинні направляти будь-яке занепокоєння
          щодо будь-якого зовнішнього посилання адміністратору такого веб сайту.
        </p>
      </div>
    </main>
  );
}
